***Name: SADDAM HUSSAIN***

***REG ID: GO_STP_6834***

---



---

# Discuss the concept of One-Hot-Encoding, Multicollinearity and the Dummy Variable Trap.  What is Nominal and Ordinal Variables ?

**One-Hot Encoding**: One of the way to convert the categorical to numerical data to be used for models. Based on the different classes of the output variable it creates that many no of columns with 0 and 1 where ever the value is there.

**Multicollinearilty**: When the variables are corelated among them, which affects the model prediction or the perfromance or accuracy. It is always preferred to drop the columns which shows multi collinearity.

**Dummy Variable Trap**: once the Categorical columns are converted to numerical data based on various classes present inside the respective columns, always leads to multicollinearity. So, it is preferred to drop one of the columns.

**Nominal**: A data type which represents just a label and nothing more than a label. It doesn't follow any order.

**Ordinal**: A data scale where the data are represents an order or the hierarchy like the rating of an app.

# Salary Dataset of 52 professors having categorical columns. Apply dummy variables concept and one-hot-encoding on categorical columns.

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_csv('https://data.princeton.edu/wws509/datasets/salary.dat', delim_whitespace=True)

In [ ]:
df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [ ]:
df.rk.unique()

array(['full', 'associate', 'assistant'], dtype=object)

Dummy Variables

In [ ]:
dummies = pd.get_dummies(df['sx'], drop_first =True)

#df = pd.concat([df, dummies], axis = 1)
df = df.join(dummies)

In [ ]:
df.drop('sx', axis=1, inplace=True)
df.head()

     rk  yr         dg  yd     sl  male
0  full  25  doctorate  35  36350     1
1  full  13  doctorate  22  35350     1
2  full  10  doctorate  23  28200     1
3  full   7  doctorate  27  26775     0
4  full  19    masters  30  33696     1

In [ ]:
#Converting Rank

dummiesRank = pd.get_dummies(df['rk'], drop_first =True)

#df = pd.concat([df, dummiesRank], axis = 1)
df = df.join(dummiesRank)

In [ ]:
df.drop('rk', axis=1, inplace=True)
df.head()

   yr         dg  yd     sl  male  associate  full
0  25  doctorate  35  36350     1          0     1
1  13  doctorate  22  35350     1          0     1
2  10  doctorate  23  28200     1          0     1
3   7  doctorate  27  26775     0          0     1
4  19    masters  30  33696     1          0     1

One-Hot Encoding

In [ ]:
df.dg.unique()

array(['doctorate', 'masters'], dtype=object)

In [ ]:
from sklearn.preprocessing import OneHotEncoder

from sklearn.compose import ColumnTransformer

In [ ]:
ct = ColumnTransformer([('dg', OneHotEncoder(), [1])],remainder = 'passthrough')

In [ ]:
newct = ct.fit_transform(df)
#newct

newData = pd.DataFrame(newct)
newData = newData.astype('int64')

newData.head()

   0  1   2   3      4  5  6  7
0  1  0  25  35  36350  1  0  1
1  1  0  13  22  35350  1  0  1
2  1  0  10  23  28200  1  0  1
3  1  0   7  27  26775  0  0  1
4  0  1  19  30  33696  1  0  1